tutorials/lagrangian/reactingParcelFilmFoam/cylinder/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
<<<<<<< HEAD
|  \\    /   O peration     | Version:  3.0.x                                 |
=======
|  \\    /   O peration     | Version:  4.x                                   |
>>>>>>> 90e2f8d87bcd3a8588545c2de68a62d5b5c54a99
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          wallFilmRegion;

faceZones       (wallFilmFaces);

sampleMode      nearestPatchFace;

oneD            false;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       yes; // apply mapped to both regions

linearNormalCoeffs
{
    thickness       0.01;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
